{
  "monthlyReflections": [
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111111",
      "reflectionMonth": 1,
      "recordedDate": null,
      "reflectionQuestion": null,
      "reflectionResponse": null
    },
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111112",
      "reflectionMonth": 2,
      "recordedDate": null,
      "reflectionQuestion": null,
      "reflectionResponse": null
    },
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111113",
      "reflectionMonth": 3,
      "recordedDate": null,
      "reflectionQuestion": null,
      "reflectionResponse": null
    },
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111114",
      "reflectionMonth": 4,
      "recordedDate": null,
      "reflectionQuestion": null,
      "reflectionResponse": null
    },
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111115",
      "reflectionMonth": 5,
      "recordedDate": null,
      "reflectionQuestion": null,
      "reflectionResponse": null
    },
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111116",
      "reflectionMonth": 6,
      "recordedDate": "2024-07-01T00:00:00Z",
      "reflectionQuestion": "What stood out to you during the month of June?",
      "reflectionResponse": "I started a new balance training program this month, and it’s been pretty tough. I was often sore afterward and ended up resting a lot, which meant I wasn’t wearing my device as much. Hoping I’ll adjust to it gradually over time."
    },
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111117",
      "reflectionMonth": 7,
      "recordedDate": "2024-08-04T00:00:00Z",
      "reflectionQuestion": "What stood out to you during the month of July?",
      "reflectionResponse": "Not as productive this month, I can see that my average daily step count is still not where I would like it to be. It’s been a bit cold so I wasn’t feeling too motivated. At least I walked more than I did in June, which I’m happy about. I’ve been trying to stay active indoors to keep warm and meet my goals, and I’d like to find more ways to do that."
    },
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111118",
      "reflectionMonth": 8,
      "recordedDate": "2024-09-04T00:00:00Z",
      "reflectionQuestion": "What stood out to you during the month of August?",
      "reflectionResponse": "A mixed-bag in terms of my average step count this month. I spent the first two weeks recovering from a sprained ankle. It was a bit disappointing since I was making a lot of progress last month. Thankfully, things improved by the end of the month, and I was able to get out more. Catching up with friends at local cafés helped me get my steps in too, more so than just having them over."
    },
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111119",
      "reflectionMonth": 9,
      "recordedDate": "2024-10-02T00:00:00Z",
      "reflectionQuestion": "What stood out to you during the month of September?",
      "reflectionResponse": "I was able to consistently meet my step count goal a lot more this month. It’s a big improvement since last month and I’m feeling really proud of my progress. Walking my neighbour’s dog for the weekend definitely kept me active, and the social walks at the park helped too. I’m feeling a lot more motivated recently and so I really hope to keep this up."
    },
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111120",
      "reflectionMonth": 10,
      "recordedDate": "2024-11-02T00:00:00Z",
      "reflectionQuestion": "What stood out to you during the month of October?",
      "reflectionResponse": "I wasn’t able to meet my daily step count goal very much this month. I was under the weather during the first week and had more non-wear days than usual since I was mostly in bed. Later in the month, I managed to do some light gardening, which helped me stay active even when I wasn’t feeling my best. I’ll try to remember that gardening is a great low-effort way to keep moving."
    },
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111121",
      "recordedDate": "2024-11-30T00:00:00Z",
      "reflectionMonth": 11,
      "reflectionQuestion": "What stood out to you during the month of November?",
      "reflectionResponse": "I have been feeling super motivated recently and happy about my progress. It’s been my best month so far and I think it had to do with a lot of unexpected events. I had friends visit from another state and so I joined them in walking around the city a few times. I’ve also been really consistent with the balance training exercises and have been regularly tending to my veggie patch. I’m finding it much easier to hit my daily step count goal."
    },
    {
      "id": "1A2B3C4D-3333-3333-3333-111111111122",
      "reflectionMonth": 12,
      "recordedDate": null,
      "reflectionQuestion": null,
      "reflectionResponse": null
    }
  ]
}
